app/Controllers/Admin/DashboardController.php

    public function index()
    {
        if ($response = $this->requireRole(['admin'])) {
            return $response;
        }

        $year = (int) date('Y');
        $today = date('Y-m-d');

        $employeModel = new EmployeModel();
        $congeModel = new CongeModel();
        $departementModel = new DepartementModel();

        $activeEmployees = $employeModel->where('actif', 1)->countAllResults();
        $pending = $congeModel->where('statut', 'en_attente')->countAllResults();
        $approvedThisMonth = $congeModel
            ->where('statut', 'approuvee')
            ->like('date_debut', date('Y-m'), 'after')
            ->countAllResults();
        $departments = $departementModel->countAllResults();

        $recent = $congeModel
            ->select('conges.*, employees.prenom, employees.nom, types_conge.libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->orderBy('conges.created_at', 'DESC')
            ->limit(3)
            ->findAll();

        $absents = $congeModel
            ->select('conges.*, employees.prenom, employees.nom, types_conge.libelle')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.statut', 'approuvee')
            ->where('conges.date_debut <=', $today)
            ->where('conges.date_fin >=', $today)
            ->orderBy('employees.nom', 'ASC')
            ->findAll();

        $soldeModel = new SoldeModel();
        $soldes = $soldeModel
            ->select('soldes.*, employees.nom, employees.prenom')
            ->join('employees', 'employees.id = soldes.employe_id')
            ->where('soldes.annee', $year)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
AND  `date_debut` LIKE '2026-05%' ESCAPE '!'
SELECT `conges`.*, `employees`.`prenom`, `employees`.`nom`, `types_conge`.`libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
ORDER BY `conges`.`created_at` DESC
 LIMIT 3
SELECT `conges`.*, `employees`.`prenom`, `employees`.`nom`, `types_conge`.`libelle`
FROM `conges`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'approuvee'
AND `conges`.`date_debut` <= '2026-05-13'
AND `conges`.`date_fin` >= '2026-05-13'
ORDER BY `employees`.`nom` ASC
SELECT `soldes`.*, `employees`.`nom`, `employees`.`prenom`
FROM `soldes`
JOIN `employees` ON `employees`.`id` = `soldes`.`employe_id`
WHERE `soldes`.`annee` = 2026