app/Controllers/Rh/DemandeController.php

SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`, `types_conge`.`deductible`, `employees`.`prenom`, `employees`.`nom`, `employees`.`department_id`, `departments`.`nom` as `departement`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
JOIN `employees` ON `employees`.`id` = `conges`.`employe_id`
LEFT JOIN `departments` ON `departments`.`id` = `employees`.`department_id`
WHERE `conges`.`statut` = 'approuvee'
ORDER BY `conges`.`created_at` DESC
---
    public function index()
    {
        if ($response = $this->requireRole(['rh'])) {
            return $response;
        }

        $statut = (string) $this->request->getGet('statut');
        $departmentId = (string) $this->request->getGet('department');
        $refuseId = (int) $this->request->getGet('refuse_id');

        $congeModel = new CongeModel();
        $builder = $congeModel
            ->select('conges.*, types_conge.libelle as type_libelle, types_conge.deductible, employees.prenom, employees.nom, employees.department_id, departments.nom as departement')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->join('employees', 'employees.id = conges.employe_id')
            ->join('departments', 'departments.id = employees.department_id', 'left');

        if ($statut !== '') {
            $builder->where('conges.statut', $statut);
        }
        if ($departmentId !== '') {
            $builder->where('employees.department_id', (int) $departmentId);
        }

        $conges = $builder->orderBy('conges.created_at', 'DESC')->findAll();

SELECT *
FROM `soldes`
WHERE `employe_id` IN (9)
AND `annee` = 2026
---
        $soldeMap = [];
        if (!empty($employeeIds)) {
            $soldeModel = new SoldeModel();
            $soldes = $soldeModel
                ->whereIn('employe_id', $employeeIds)
                ->where('annee', $year)
                ->findAll();

SELECT *
FROM `conges`
WHERE `conges`.`id` = 5
SELECT *
FROM `soldes`
WHERE `employe_id` = 9
AND `type_conge_id` = 11
AND `annee` = 2026
 LIMIT 1
---
    public function approve(int $id)
    {
        if ($response = $this->requireRole(['rh'])) {
            return $response;
        }

        $congeModel = new CongeModel();
        $conge = $congeModel->find($id);
        if (!$conge || $conge['statut'] !== 'en_attente') {
            return redirect()->back()->with('error', 'Demande invalide ou deja traitee.');
        }

        $typeModel = new TypeCongeModel();
        $type = $typeModel->find((int) $conge['type_conge_id']);
        if (!$type) {
            return redirect()->back()->with('error', 'Type de conge introuvable.');
        }

        if ((int) $type['deductible'] === 1) {
            $year = (int) date('Y', strtotime($conge['date_debut']));
            $soldeModel = new SoldeModel();
            $solde = $soldeModel
                ->where('employe_id', (int) $conge['employe_id'])
                ->where('type_conge_id', (int) $conge['type_conge_id'])
                ->where('annee', $year)
                ->first();

UPDATE `soldes` SET `jours_pris` = 3
WHERE `soldes`.`id` IN (17)
UPDATE `conges` SET `statut` = 'approuvee', `commentaire_rh` = NULL, `traite_par` = 8, `updated_at` = '2026-05-13 08:21:07'
WHERE `conges`.`id` IN (5)
---
                return redirect()->back()->with('error', 'Solde insuffisant pour approuver.');
            }

            $soldeModel->update($solde['id'], [
                'jours_pris' => (int) $solde['jours_pris'] + (int) $conge['nb_jours'],
            ]);
        }

        $commentaire = (string) $this->request->getPost('commentaire_rh');
        $congeModel->update($id, [
            'statut' => 'approuvee',
            'commentaire_rh' => $commentaire !== '' ? $commentaire : null,
            'traite_par' => (int) $this->session->get('user_id'),
        ]);

SELECT `soldes`.*, `employees`.`prenom`, `employees`.`nom`, `types_conge`.`libelle`
FROM `soldes`
JOIN `employees` ON `employees`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`annee` = 2026
ORDER BY `employees`.`nom` ASC
---
    public function soldes()
    {
        if ($response = $this->requireRole(['rh'])) {
            return $response;
        }

        $year = (int) date('Y');
        $soldeModel = new SoldeModel();
        $soldes = $soldeModel
            ->select('soldes.*, employees.prenom, employees.nom, types_conge.libelle')
            ->join('employees', 'employees.id = soldes.employe_id')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.annee', $year)
            ->orderBy('employees.nom', 'ASC')
            ->findAll();