app/Controllers/Employe/DashboardController.php

    public function index()
    {
        if ($response = $this->requireRole(['employe'])) {
            return $response;
        }

        $employeId = (int) $this->session->get('user_id');
        $year = (int) date('Y');

        $congeModel = new CongeModel();
        $pending = $congeModel->where('employe_id', $employeId)->where('statut', 'en_attente')->countAllResults();
        $approved = $congeModel->where('employe_id', $employeId)->where('statut', 'approuvee')->countAllResults();
        $refused = $congeModel->where('employe_id', $employeId)->where('statut', 'refusee')->countAllResults();

        $soldeModel = new SoldeModel();
        $soldes = $soldeModel
            ->select('soldes.*, types_conge.libelle, types_conge.jours_annuels, types_conge.deductible')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.employe_id', $employeId)
            ->where('soldes.annee', $year)
            ->orderBy('types_conge.libelle')
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 9
AND `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 9
AND `statut` = 'approuvee'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 9
AND `statut` = 'refusee'
SELECT `soldes`.*, `types_conge`.`libelle`, `types_conge`.`jours_annuels`, `types_conge`.`deductible`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 9
AND `soldes`.`annee` = 2026
ORDER BY `types_conge`.`libelle`

        }
        unset($solde);

        $recent = $congeModel
            ->select('conges.*, types_conge.libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $employeId)
            ->orderBy('conges.date_debut', 'DESC')
            ->limit(3)
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 9
ORDER BY `conges`.`date_debut` DESC
 LIMIT 3